In [7]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(101) ## uses 101 as the initiator 

##seed to have the same output as much as it is random

In [3]:
a=[10,20,20]
##numeric non numeric
b=['A','b','c']
arr=np.array([1,2,3])
dictionary={'a':10,'b':11,'c':12}

## Series

In [4]:
pd.Series(a)  ##accesing a list as series and from output they have an axis

0    10
1    20
2    20
dtype: int64

In [5]:
## simialr to an array only that it has axis labels and can have an index or an abitrary holder eg a name while a array has index

In [6]:
## creating a series w index as labes
pd.Series(data=a,index=b)

A    10
b    20
c    20
dtype: int64

In [7]:

## creating a series from numpy arrays
pd.Series(arr,b)

A    1
b    2
c    3
dtype: int64

In [8]:
##creating a series from a dictionary
pd.Series(dictionary)

a    10
b    11
c    12
dtype: int64

## series indexing for lookup

In [9]:
ser1=pd.Series([1,2,3,4], index=['usa','uusr','kenya','uganda']) ## have data then index
ser1

usa       1
uusr      2
kenya     3
uganda    4
dtype: int64

In [10]:
ser1['usa']

1

## DATAFRAME

In [11]:
## many series combined sharing the same index (df is our dataframe)(split stringindex along spaces )
df=pd.DataFrame(randn(5,4),index= 'A B C D E'.split(),columns='W X Y Z'.split())

In [12]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and indexing

In [13]:
## select a single coloumn
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [14]:
type(df['W'])    ##showing the single column output is a series

pandas.core.series.Series

In [15]:
## selecting a list of coolomuns
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [16]:
## adding a new column
df['new']= df['W']+df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
## dropping df a

df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [18]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df.drop('new',axis=1,inplace=True) 
##to effect the change permanently can be excuted only once axis0 if not sppecified

## LOC and ILOC

In [20]:
##loc uses axis lables and iloc used the indexs
##selecting rows using lables

df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [21]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [22]:
## Indexing and resetting of the index

df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [23]:
##resetting index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [30]:
## create a new index
newind='KEN UG TZN ETH SOMALI'.split()

In [31]:
## creating new col
df['Country']=newind
df

          W         X         Y         Z Country
A  2.706850  0.628133  0.907969  0.503826     KEN
B  0.651118 -0.319318 -0.848077  0.605965      UG
C -2.018168  0.740122  0.528813 -0.589001     TZN
D  0.188695 -0.758872 -0.933237  0.955057     ETH
E  0.190794  1.978757  2.605967  0.683509  SOMALI

In [34]:
df.set_index('Country')

                W         X         Y         Z
Country
KEN      2.706850  0.628133  0.907969  0.503826
UG       0.651118 -0.319318 -0.848077  0.605965
TZN     -2.018168  0.740122  0.528813 -0.589001
ETH      0.188695 -0.758872 -0.933237  0.955057
SOMALI   0.190794  1.978757  2.605967  0.683509

In [36]:
df.set_index('Country',inplace=True)

In [37]:
df

                W         X         Y         Z
Country
KEN      2.706850  0.628133  0.907969  0.503826
UG       0.651118 -0.319318 -0.848077  0.605965
TZN     -2.018168  0.740122  0.528813 -0.589001
ETH      0.188695 -0.758872 -0.933237  0.955057
SOMALI   0.190794  1.978757  2.605967  0.683509

## Handling missing values

In [38]:
## missing values replace false w nulls and 
df>0

             W      X      Y      Z
Country
KEN       True   True   True   True
UG        True  False  False   True
TZN      False   True   True  False
ETH       True  False  False   True
SOMALI    True   True   True   True

In [43]:
##replacing neg w nals not a number
df[df>0]

            W     X     Y     Z
Country
KEN      True  True  True  True
UG       True   NaN   NaN  True
TZN       NaN  True  True   NaN
ETH      True   NaN   NaN  True
SOMALI   True  True  True  True

In [44]:

df

             W      X      Y      Z
Country
KEN       True   True   True   True
UG        True  False  False   True
TZN      False   True   True  False
ETH       True  False  False   True
SOMALI    True   True   True   True

In [62]:
df=df[df>0]
df

            W     X     Y     Z
Country
KEN      True  True  True  True
UG       True   NaN   NaN  True
TZN       NaN  True  True   NaN
ETH      True   NaN   NaN  True
SOMALI   True  True  True  True

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, KEN to SOMALI
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       4 non-null      object
 1   X       3 non-null      object
 2   Y       3 non-null      object
 3   Z       4 non-null      object
dtypes: object(4)
memory usage: 200.0+ bytes

In [48]:
df.isnull().any()
##to know if a column has a null value becomes true any(looks at everything)

W    True
X    True
Y    True
Z    True
dtype: bool

In [50]:
##to know the number of missing values in each column
df.isnull().sum()   ##count the missing values

W    1
X    2
Y    2
Z    1
dtype: int64

In [51]:
##dropping columns w nulls
df.dropna() ## df.dropna(axis=0)

            W     X     Y     Z
Country
KEN      True  True  True  True
SOMALI   True  True  True  True

In [53]:
##dropping along th rows
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [KEN, UG, TZN, ETH, SOMALI]

In [59]:
df1=df.fillna(value='fill value')

                  W           X           Y           Z
Country
KEN            True        True        True        True
UG             True  fill value  fill value        True
TZN      fill value        True        True  fill value
ETH            True  fill value  fill value        True
SOMALI         True        True        True        True

In [56]:
df1 ##calling df1 cause it the one w the changes unless you commit df w inplace true to make it permanent

                  W           X           Y           Z
Country
KEN            True        True        True        True
UG             True  fill value  fill value        True
TZN      fill value        True        True  fill value
ETH            True  fill value  fill value        True
SOMALI         True        True        True        True

In [57]:
##filling  w the mean
df2=df.fillna(value=df['W'].mean())

In [58]:
df2

            W     X     Y     Z
Country
KEN      True  True  True  True
UG       True   1.0   1.0  True
TZN       1.0  True  True   1.0
ETH      True   1.0   1.0  True
SOMALI   True  True  True  True

##lambda functions and syntax
##an anoymous function function with no name normal functions in python are defined by def keywords while 
##anoymous functions are defined by lambda keyword
##has three essential key words
#lambda key word
paramaters
function body

In [1]:
lambda p1,p2 : expression

In [2]:
adder=lambda x,y : (x+y)
print(adder(2,4))  ##func adder adds the two numbers

6

In [3]:
double=lambda x: (x*2)
print(double(4))

8

In [4]:
##compaire with normal functions
def double(x):
    return x*2
print (double(10))

20

In [5]:
##lambda function in mapping ... mapping is transforming as per given conditions ... maps or changes the whole data at once 
sequences=[10,20,30,30,40,1]
result=map(lambda x : x*x,sequences)
print(list(result))

[100, 400, 900, 900, 1600, 1]

In [6]:
##using lamda and filtering condition
##list is a key word as seen above hence
old_list=[1,2,3,4,5,6,22,31,8,7]
new_list=list(filter(lambda x:(x%2==0),old_list)) ##filter out even number. x divide by two the reminder is 0
print(new_list)

[2, 4, 6, 22, 8]

## Merging joining and concatination

In [11]:
df1=pd.DataFrame({'A': ['A0','A1','A2','A3'],'B': ['B0','B1','B2','B3'],
                  'C': ['C0','C1','C2','C3'],'D': ['D0','D1','D2','D3']},index=[0,1,2,3,])

df2=pd.DataFrame({'A': ['A4','A5','A6','A7'],'B': ['B4','B5','B6','B7'],
                  'C': ['C4','C5','C6','C7'],'D': ['D4','D5','D6','D7']},index=[4,5,6,7])

df3=pd.DataFrame({'A': ['A8','A9','A10','A11'],'B': ['B8','B9','B10','B11'],
                  'C': ['C8','C9','C10','C11'],'D': ['D8','D9','D10','D11']},index=[8,9,10,11])

In [16]:
df1 , df2

(    A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1
 2  A2  B2  C2  D2
 3  A3  B3  C3  D3,
     A   B   C   D
 4  A4  B4  C4  D4
 5  A5  B5  C5  D5
 6  A6  B6  C6  D6
 7  A7  B7  C7  D7)

In [14]:
pd.concat([df1,df2,df3])   ##by default it is along axis 0 piling on top of each other

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [18]:
pd.concat([df1,df2,df3], axis=1)  ## where there is no data nan

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [22]:
##merging
left=pd.DataFrame({'key': ['K0','K1','K2','K3'],'B': ['B0','B1','B2','B3'], 'C': ['C0','C1','C2','C3']})

right=pd.DataFrame({'key': ['K0','K1','K2','K3'],'D': ['B8','B9','B10','B11'],
                  'E': ['C8','C9','C10','C11']})

In [23]:
left

  key   B   C
0  K0  B0  C0
1  K1  B1  C1
2  K2  B2  C2
3  K3  B3  C3

In [24]:
right

  key    D    E
0  K0   B8   C8
1  K1   B9   C9
2  K2  B10  C10
3  K3  B11  C11

In [26]:
pd.merge(left,right,how='inner',on='key')     ##merges all key values as one

  key   B   C    D    E
0  K0  B0  C0   B8   C8
1  K1  B1  C1   B9   C9
2  K2  B2  C2  B10  C10
3  K3  B3  C3  B11  C11

In [27]:
left1=pd.DataFrame({'key1': ['K0','K0','K1','K2'],'key2': ['K0','K1','K0','K1'],
                    'B': ['B0','B1','B2','B3'], 'C': ['C0','C1','C2','C3']})

right1=pd.DataFrame({'key1': ['K0','K1','K1','K2'],'key2': ['K0','K0','K0','K0'],
                     'D': ['B8','B9','B10','B11'],'E': ['C8','C9','C10','C11']})

In [28]:
right1

  key1 key2    D    E
0   K0   K0   B8   C8
1   K1   K0   B9   C9
2   K1   K0  B10  C10
3   K2   K0  B11  C11

In [33]:
left1

  key1 key2   B   C
0   K0   K0  B0  C0
1   K0   K1  B1  C1
2   K1   K0  B2  C2
3   K2   K1  B3  C3

In [31]:
pd.merge(left1,right1,on=['key1','key2'])    ##by default its inner merging keys that only match

  key1 key2   B   C    D    E
0   K0   K0  B0  C0   B8   C8
1   K1   K0  B2  C2   B9   C9
2   K1   K0  B2  C2  B10  C10

In [32]:
##outer merge meaning it will merge the ones that match and the ones that dont are placed w nan
pd.merge(left1,right1,how='outer',on=['key1','key2'])

  key1 key2    B    C    D    E
0   K0   K0   B0   C0   B8   C8
1   K0   K1   B1   C1  NaN  NaN
2   K1   K0   B2   C2   B9   C9
3   K1   K0   B2   C2  B10  C10
4   K2   K1   B3   C3  NaN  NaN
5   K2   K0  NaN  NaN  B11  C11

In [34]:
##right merge will merge on the right table everything matching
pd.merge(left1,right1,how='right',on=['key1','key2'])

  key1 key2    B    C    D    E
0   K0   K0   B0   C0   B8   C8
1   K1   K0   B2   C2   B9   C9
2   K1   K0   B2   C2  B10  C10
3   K2   K0  NaN  NaN  B11  C11

In [37]:
left1 , right1

(  key1 key2   B   C
 0   K0   K0  B0  C0
 1   K0   K1  B1  C1
 2   K1   K0  B2  C2
 3   K2   K1  B3  C3,
   key1 key2    D    E
 0   K0   K0   B8   C8
 1   K1   K0   B9   C9
 2   K1   K0  B10  C10
 3   K2   K0  B11  C11)

In [35]:
pd.merge(left1,right1,how='left',on=['key1','key2'])  ##ones found in right that cant be mapped in left are left out
                                                      ##the refrence is left table only replacing and adding what is there 2 similar rows cause right had two colums

  key1 key2   B   C    D    E
0   K0   K0  B0  C0   B8   C8
1   K0   K1  B1  C1  NaN  NaN
2   K1   K0  B2  C2   B9   C9
3   K1   K0  B2  C2  B10  C10
4   K2   K1  B3  C3  NaN  NaN